<script>
export default {
  data() {
    return {
      questions: [
        {
          id: "1",
          title: "Чому варто обрати саме курси INTO.IT?",
          content: "Ми пропонуємо авторські курси навчання спрямовані саме на результат! (Goal Oriented).\n" +
              "     Це означає, що найважливішим є саме досягнення поставленої мети, наприклад підготовка до університету чи\n" +
              "     професійне створення веб-сторінок. Наша ціль надати структуровані знання з обраних студентом галузей щоб сприяти\n" +
              "     розвитку української молоді та їх інтересу до програмування."
        },
        {
          id: "2",
          title: "Як проходитимуть заняття?",
          content: "Заняття в нашій академії проводяться за системою проектного навчання. Це означає, що розподіл буде наступним: 30% — теорія, 70% — практика.\n" +
              "     Проектне навчання спрямоване на практичне засвоєння матеріалу учнями. До того ж, шанс втратити інтерес до навчання набагато нижчий аніж при класичній системі навчання,\n" +
              "     що практикується в школах та університетах. Заняття проходитимуть в онлайн режимі у системі Google Meet, а контроль успіхів студентів у Google Classroom групами до 6 студентів.\n" +
              "     Через воєнні події, задля вашої безпеки, врахувавши досвід минулих років, ми перестали вести заняття офлайн. Сподіваємось на ваше розуміння!"
        },
        {
          id: "3",
          title: "За яким розкладом проходитимуть заняття?",
          content: "Розклад занять буде будуватись одразу після сформування навчальної групи з 6 учнів з врахуванням\n" +
              "          ваших побажань. Заняття проводимуться 2 рази на тиждень тривалістю по 1.5 (півтори) години."
        },
        {
          id: "4",
          title: "Де використовуються знання з курсів?",
          content: "Ні для кого не секрет, якими темпами прогресує сфера IT технологій. Наші курси спрямовані на загальний\n" +
              "          доуніверситетький професійний розвиток, так званий вхід (Introduction) в цю сферу. Досвід з розробки веб-сторінок застосовується скрізь:\n" +
              "        сфера послуг, маркетинг, дропшипінг, інтернет магазини і ще багато чого іншого! Кожну зі своїх ідей можливо візуалізувати на представити всьому\n" +
              "          світові саме завдяки цим технологіям! Java — це мова програмування для складних бізнес рішень, таких як банківські системи і в цілому те, що\n" +
              "          повинно бути надійним і захищеним. Але в контексті курсів ми вивчаємо її як першу мову для Back-End розробки та кодування алгоритмів.\n" +
              "          Знання з курсу Java розробник стануть в пригоді при навчанні в університеті. Студент вже матиме потрібний багаж знань для подальшого вивчення програми спеціальності 122 Комп'ютерні науки."

        },
        {
          id: "5",
          title: "Чи можна проходити курс на індивідуальній основі?",
          content: "Так, можна. Але при цьому, ціна курсу значно зросте. В індивідуальному форматі навчання повна ціна " +
              "16 занять тривалістю по 1.5 (півтори) години кожне складатиме 9000 грн. При індивідуальному форматі і оплаті кожного заняття окремо ціна 600 грн. за заняття." +
              "Також, ми надаємо можливість покупки лише записів занять навчальної групи, без участі та присутності на заняттях. Навіть так, курс буде вважатись пройденим і відбудется" +
              " тестування успішності учня (іспит) та буде видано сертифікат. Ціна лише записів навчальних уроків курсу + іспит — 1600 грн. (50% вартості).",
        },
        {
          id: "6",
          title: "Як відбувається сертифікація після закінчення навчання?",
          content: "Після закінчення навчання, а саме всіх 16 занять кожен студент буде запрошений до усного та практичного іспиту з викладачем. Будуть перевірені всі навички " +
              "засвоєні на курсі та виставлено загальну оцінку від 0 до 100. Студент, що пройшов іспит сертифікацію на меньше ніж 60% не отримує сертифікату відзнаки пройденого курсу. " +
              "Сертифікат може бути видано фізично і відправлено поштою (за потреби) та в онлайн варіанті з заповненими ПІБ, та оцінкою студента (PDF + посилання). ",
        },
        {
          id: "7",
          title: "Коли початок занять?",
          content: "Одразу після формування навчальних груп, студенти узгоджують зручний час для проведення уроків. Навчання починається з 01.07 по 06.07 (липень) та тривають 2 (два) місяці." +
              " Відповідно орієнтовна дата завершення курсу це 26.08 - 01.09.",
        },
        {
          id: "8",
          title: "Чи можу я платити за кожен урок окремо?",
          content: "Так! І це надасть вам можливість припинити навчання за потреби в будь який час. Але вартість навчання при формі оплати кожного заняття окремо зростає. " +
              "У форматі навчання групами до 6 осіб на будь якому з курсів вартість заняття — 250 грн. У форматі навчання індивідуально вартість одного заняття — 600 грн. " +
              "У форматі самостійного навчання (придбання записів занять + сертифікація) — 100грн.",
        },
        {
          id: "9",
          title: "Чи гарантується працевлаштування після курсу?",
          content: "Ні, не гарантується. Ми не маємо партнерства з іншими IT компаніями щоб гарантувати працевлаштування. Але ми впевнені, що шанс потрапити на достойну" +
              " позицію в одній з кращих компаній значно більший після отримання знань з наших курсів!",
        },
        {
          id: "10",
          title: "Чи повернуть кошти, якщо я перестану вчитись на курсі?",
          content: "Ні, не повернуть. Винятки можливі лише при виникненні дуже критичних і неприємних ситуацій при навчанні у нашій академії. В такому разі ми повернемо вам усю сумму за курс. Ми цінуємо наших клієнтів та свою репутацію!",
        },
        {
          id: "11",
          title: "Не знайшов потрібного мені питання",
          content: "Якщо ви не знайшли відповіді на потрібне вам запитання зі списку вище, зателефонуйте нам або заповінть форму в розділі \"Контакти\" та вкажіть ваше питання в коментарях!" +
              " Ми не залишимо вас без відповіді! Наші менеджери допоможуть вам у вирішення будь-яких питань!",
        },
      ]
    }
  }
}
</script>

<template>
  <div class="faq-question" v-for="question in questions">
    <input :id="'q' + question.id" type="checkbox" class="panel">
    <span class="plus material-symbols-rounded">
            add_circle
          </span>
    <label :for="'q' + question.id" class="panel-title"> {{ question.title }} </label>
    <div class="panel-content">
      {{ question.content }}
    </div>
  </div>
</template>

<style scoped lang="scss">
.faq-question {
  padding: 20px 0;
  border-bottom: 1px solid var(--custom-black);

  span {
    font-weight: 600;

    span {
      color: var(--red-color);
    }
  }
}

.panel-title {
  font-size: 24px;
  width: 100%;
  position: relative;
  margin: 0 0 0 15px;
  padding: 10px 10px 0 48px;
  display: block;
  cursor: pointer;
}

.panel-content {
  color: var(--custom-black);
  font-size: 20px;
  padding: 0 14px;
  margin: 0 40px;
  height: 0;
  overflow: hidden;
  z-index: -1;
  position: relative;
  opacity: 0;
  -webkit-transition: .4s ease-in-out;
  -moz-transition: .4s ease-in-out;
  -o-transition: .4s ease-in-out;
  transition: .4s ease-in-out;
}

.panel:checked ~ .panel-content {
  height: auto;
  opacity: 1;
  padding: 14px;
}

.plus {
  color: var(--red-color);
  position: absolute;
  margin-top: 4px;
  font-size: 42px;
  line-height: 100%;
  -webkit-user-select: none;
  -moz-user-select: none;
  -ms-user-select: none;
  -o-user-select: none;
  user-select: none;
  -webkit-transition: .4s ease-in-out;
  -moz-transition: .4s ease-in-out;
  -o-transition: .4s ease-in-out;
  transition: .4s ease-in-out;
}

.panel:checked ~ .plus {
  -webkit-transform: rotate(45deg);
  -moz-transform: rotate(45deg);
  -o-transform: rotate(45deg);
  transform: rotate(45deg);
}

.panel {
  display: none;
}


</style>